# Banco de Dados - Prof. Sérgio Lifschitz

---

## Exercícios da Aula 1: Introdução à Linguagem SQL DML (consultas)


---


ANTES de começar,  ❗ **não esquecer** ❗ de, antes de mais nada, SALVAR este notebook no ambiente COLAB no drive da tua própria conta GOOGLE.

## PASSO 1: Instalação e Configuração do PostgreSQL

Basta dar PLAY que o script abaixo instalará o SGBD PostgreSQL

In [100]:
# %%capture
# Instalação do PostgreSQL
!pip install sqlalchemy==2.0

Requirement already satisfied: sqlalchemy==2.0 in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (2.0.0)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from sqlalchemy==2.0) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from sqlalchemy==2.0) (3.1.1)

[notice] A new release of pip is available: 23.1.2 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

## PASSO 3: Preparando para usar o SGBD PostgreSQL localmente

In [101]:
!pip install ipython-sql
!pip install psycopg2

Requirement already satisfied: ipython-sql in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from ipython-sql) (3.12.0)
Requirement already satisfied: ipython in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from ipython-sql) (8.29.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from ipython-sql) (2.0.0)
Requirement already satisfied: sqlparse in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from ipython-sql) (0.5.1)
Requirement already satisfied: six in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (3.1.1)
Requirement already satisfied: decorator in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: matplotlib-inline in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from ipython->ipython-sql) (3.0.48)
Requirement already satisfied: pygments>=2.4.0 in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from ipython->ipython-sql) (2.18.0)
Requirement already satisfied: stack-data in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: colorama in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: wcwidth in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: executing>=1.2.0 in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from stack-data->ipython->ipython-sql) (2.1.0)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from stack-data->ipython->ipython-sql) (2.4.1)
Requirement already satisfied: pure-eval in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.3)

[notice] A new release of pip is available: 23.1.2 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: psycopg2 in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (2.9.10)

[notice] A new release of pip is available: 23.1.2 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [102]:
# Carregando a extensão sql para usar o SQL pelo Google Colab

%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## O que tem q ser editado é na celula abaixo:
<ul>
    <li> Nome do db e senha e user do db </li>
</ul>

In [ ]:
from sqlalchemy import create_engine

%sql postgresql://postgres:password@localhost:5432/db_name

In [152]:
%%sql
SET SCHEMA 'carros';

 * postgresql://postgres:***@localhost:5432/pos_db
   postgresql://postgres:***@localhost:5432/postgres
Done.

Empty DataFrame
Columns: []
Index: []

## Lista de Exercícios para prática de SQL

Consultas simples sobre o esquema CARROS implantado no SGBD PostgreSQL

### Esquema relacional da base de dados Carros:

![image.png]()

Chaves primárias sublinhadas e chaves estrangeiras em itálico.

Na relação AUTOMOVEIS cada automóvel é identificado por um código nacional, de acordo com o par (nome do fabricante, modelo do carro). Os preços de tabela são determinados também pelo ano do carro. Logo, o par de atributos (Código,Ano) é PK da tabela AUTOMOVEIS. O país é a referência do país onde aquele carro foi inicialmente produzido.

Apenas revendedoras autorizadas, cadastradas na relação REVENDEDORAS, podem vender os carros no mercado. Estas podem estar em diversas cidades e estados do país e seu CGC (ou CNPJ) identifica cada uma delas. Logo, CGC é PK de Revendedoras. Consta também o nome da revendedora e a identidade (CPF) de seu proprietário.

As pessoas que podem comprar automóveis são identificadas por seu CPF, e são guardadas na relação CONSUMIDORES, que também contém nome e sobrenome, além da cidade e estado em que essas pessoas moram.  Os consumidores são compradores em potencial, isto é, para comprar, é preciso ser consumidor. Observar que um proprietário de revendedora pode ser um consumidor mas nem todas as pessoas já realizaram alguma compra de automóveis. Logo, o atributo Proprietário é FK da tabela REVENDEDORAS, referenciando valores de CPFs na tabela CONSUMIDORES.

Cada compra-e-venda de carros é registrada na tabela NEGOCIOS, com detalhamento de data e preço pago, além do CPF do comprador (FK referenciando CPF na tabela CONSUMIDORES), o CGC da loja onde comprou (FK para CGC na tabela REVENDEDORA) e do par código e ano do automóvel (FK referenciando a PK da tabela AUTOMOVEIS). Supõe-se que um mesmo consumidor não compra um automóvel de características idênticas em uma mesma revendora em datas iguais. Por isso, os atributos Data (da compra) e Preço (efetivamente pago) não fazem parte da chave primária de NEGOCIOS.

Por fim, a relação GARAGEM determina quais automóveis as revendoras têm a intenção de negociar, e qual seu potencial de vendas, isto é, a quantidade de carros em sua garagem que pode ser negociada, na própria loja física ou sob encomenda da fábrica. As quantidades são sempre positivas e não nulas, isto é, adota-se a hipótese do mundo fechado (vídeo aula 1!). Cabe observar que a PK é composta de três atributos, e estes compõem FK para outras tabelas, a saber, CGC para a PK de Revendedoras, e o Código e Ano  referenciam valores da PK em AUTOMOVEIS.

### Exemplo de consulta:

## 1. Quais automóveis italianos na base de dados?

Para rodar a consulta em SQL abaixo, basta dar PLAY nesta célula!
Se quiser, pode mudar o país e verificar as respostas (instâncias!) distintas.

In [118]:
!pip install prettytable
!pip install pandas

Requirement already satisfied: prettytable in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (3.12.0)
Requirement already satisfied: wcwidth in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from prettytable) (0.2.13)

[notice] A new release of pip is available: 23.1.2 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

Collecting pandas
  Using cached pandas-2.2.3-cp311-cp311-win_amd64.whl (11.6 MB)
Collecting numpy>=1.23.2 (from pandas)
  Downloading numpy-2.1.3-cp311-cp311-win_amd64.whl (12.9 MB)
                                              0.0/12.9 MB ? eta -:--:--
     -                                        0.4/12.9 MB 13.2 MB/s eta 0:00:01
     ------                                   2.2/12.9 MB 28.2 MB/s eta 0:00:01
     ----------                               3.5/12.9 MB 32.0 MB/s eta 0:00:01
     -------------                            4.4/12.9 MB 28.2 MB/s eta 0:00:01
     ----------------                         5.5/12.9 MB 26.9 MB/s eta 0:00:01
     -------------------                      6.2/12.9 MB 26.4 MB/s eta 0:00:01
     ------------------------                 8.0/12.9 MB 28.5 MB/s eta 0:00:01
     --------------------------------        10.7/12.9 MB 36.4 MB/s eta 0:00:01
     --------------------------------------  12.9/12.9 MB 38.6 MB/s eta 0:00:01
     --------------------------------------- 12.9/12.9 MB 34.4 MB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2024.2-py2.py3-none-any.whl (508 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2024.2-py2.py3-none-any.whl (346 kB)
Requirement already satisfied: six>=1.5 in c:\users\eulal\ideaprojects\post-graduation-dev-fullstack-general-code\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-2.1.3 pandas-2.2.3 pytz-2024.2 tzdata-2024.2

[notice] A new release of pip is available: 23.1.2 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [119]:
import prettytable
import pandas as pd

print(prettytable.__dict__.keys())

dict_keys(['__name__', '__doc__', '__package__', '__loader__', '__spec__', '__path__', '__file__', '__cached__', '__builtins__', 'annotations', 'Any', '_version', '__version__', 'prettytable', '_DEPRECATED_ALL', '_DEPRECATED_DEFAULT', '_DEPRECATED_DOUBLE_BORDER', '_DEPRECATED_FRAME', '_DEPRECATED_HEADER', '_DEPRECATED_MARKDOWN', '_DEPRECATED_MSWORD_FRIENDLY', '_DEPRECATED_NONE', '_DEPRECATED_ORGMODE', '_DEPRECATED_PLAIN_COLUMNS', '_DEPRECATED_RANDOM', '_DEPRECATED_SINGLE_BORDER', 'HRuleStyle', 'PrettyTable', 'RowType', 'TableHandler', 'TableStyle', 'VRuleStyle', '_warn_deprecation', 'from_csv', 'from_db_cursor', 'from_html', 'from_html_one', 'from_json', '__all__', '__getattr__'])

In [125]:
%config SqlMagic.autopandas = True

%config SqlMagic.style = '_deprecated_default'

In [126]:
%%sql 
SELECT * FROM carros.automoveis WHERE pais = 'Italia';

 * postgresql://postgres:***@localhost:5432/pos_db
   postgresql://postgres:***@localhost:5432/postgres
11 rows affected.

,codigo,ano,fabricante,modelo,preco_tabela,pais
0,1051,88,Fiat,Elba,6200.00,Italia
1,1051,89,Fiat,Elba,7600.00,Italia
2,1052,93,Fiat,Tempra,18800.00,Italia
3,1053,95,Fiat,Tipo,13000.00,Italia
4,1052,94,Fiat,Tempra,20500.00,Italia
5,1051,90,Fiat,Elba,10800.00,Italia
6,1052,95,Fiat,Tempra,34000.00,Italia
7,1051,95,Fiat,Elba,18300.00,Italia
8,1201,95,Ferrari,512,330000.00,Italia
9,1051,93,Fiat,Elba,12600.00,Italia
10,1202,95,Ferrari,348,215000.00,Italia

---

Tente agora definir as seguintes consultas em SQL. Após o último exercício, disponibilizamos algumas soluções propostas para simples conferência.

## 2. Listar os nomes dos fabricantes dos automóveis na base de dados e os respectivos países de origem.

In [204]:
%%sql
SELECT DISTINCT fabricante,pais FROM carros.automoveis order by fabricante;

 * postgresql://postgres:***@localhost:5432/pos_db
   postgresql://postgres:***@localhost:5432/postgres
32 rows affected.

              fabricante                  pais
0   Audi                  Alemanha
1   BMW                   Alemanha
2   Chevrolet             EUA
3   Citroen               Franca
4   Daewoo                Coreia
5   Daihatsu              Coreia
6   Ferrari               Italia
7   Fiat                  Italia
8   Fiat                  Brasil
9   Ford                  Brasil
10  Ford                  EUA
11  General Motors        EUA
12  Gurgel                Brasil
13  Honda                 Japao
14  Hyundai               Coreia
15  Jac                   Brasil
16  Lada                  Russia
17  Land Rover            Inglaterra
18  Mazda                 Japao
19  Mercedes Benz         Alemanha
20  Mercedez Benz         Alemanha
21  Mitsubishi            Japao
22  Nissan                Japao
23  Peugeot               Franca
24  Porsche               UK
25  Porsche               Inglaterra
26  Renault               Franca
27  Rolls Royce           Inglaterra
28  Suzuki                Japao
29  Toyota                Japao
30  Volkswagen            Alemanha
31  Volvo                 Suecia

## 3. Listar os nomes das pessoas que são potenciais compradoras de automóveis, moradoras do estado do Rio de Janeiro, e que também sejam proprietárias de revendedoras

In [170]:
%%sql
SELECT * from revendedoras;

 * postgresql://postgres:***@localhost:5432/pos_db
   postgresql://postgres:***@localhost:5432/postgres
73 rows affected.

,cgc,nome,estado,cidade,proprietario
0,10010,Self Car,RJ,Rio de Janeiro,5698-8
1,10330,Dirija,RJ,Campos,5698-8
2,10030,Bahia Veiculos,BA,Ilheus,5698-8
3,10690,Sopave,RJ,Rio de Janeiro,5698-8
4,10640,Biguacu,PR,Curitiba,5698-8
...,...,...,...,...,...
68,10210,Izio,ES,Vitoria,9753-3
69,10280,Lian,RS,Bage,9753-3
70,10610,Mirage,BA,Salvador,9753-3
71,10600,Deck,PR,Maringa,9753-3
72,10450,Tania,SP,Sao Paulo,9753-3

In [209]:
%%sql
SELECT nome FROM consumidores WHERE estado = 'RJ' AND consumidores.cpf IN (SELECT proprietario FROM revendedoras);

 * postgresql://postgres:***@localhost:5432/pos_db
   postgresql://postgres:***@localhost:5432/postgres
8 rows affected.

              nome
0  Paulo
1  Marcos
2  Benedita
3  Gilberto
4  Romario
5  Claudio
6  Caetano
7  Vera

## 4. Quais revendedoras presentes nos estados da Bahia e Pernambuco?

In [173]:
%%sql
SELECT * from revendedoras where estado = 'BA' or estado = 'PE';

 * postgresql://postgres:***@localhost:5432/pos_db
   postgresql://postgres:***@localhost:5432/postgres
11 rows affected.

,cgc,nome,estado,cidade,proprietario
0,10030,Bahia Veiculos,BA,Ilheus,5698-8
1,10100,Self Car,BA,Salvador,8981-1
2,10020,Courcelles,BA,Salvador,8981-1
3,10540,Superauto,BA,Feira de Santana,8981-1
4,10180,Libra,PE,Olinda,6565-5
5,10790,Caltabiano,PE,Recife,9753-3
6,10040,Fracalanza,PE,Olinda,7192-2
7,10310,Lian,PE,Recife,7192-2
8,10080,Self Car,PE,Recife,5698-8
9,10420,Cavox,PE,Recife,5698-8
10,10610,Mirage,BA,Salvador,9753-3

## 5. Quais são os automóveis no banco de dados, com valor tabelado superior a 120 mil reais, que ainda não foram comprados por consumidor algum?

In [180]:
%%sql
select * from negocios;

 * postgresql://postgres:***@localhost:5432/pos_db
   postgresql://postgres:***@localhost:5432/postgres
24 rows affected.

    codigo ano    cgc           cpf        data     preco
0     1111  95  10460  7685-5        1995-08-15   8250.00
1     1051  90  10980  7119-9        1995-06-29  11000.00
2     1121  95  10140  6738-8        1995-03-09  61500.00
3     1053  95  10780  6675-5        1995-05-05  14000.00
4     1021  89  10310  5598-8        1995-07-21   9100.00
5     1121  95  10500  5111-1        1995-02-22  63000.00
6     1131  95  10010  8894-4        1995-05-20  15000.00
7     1151  95  10170  8775-5        1995-08-25  53000.00
8     1071  94  10040  5222-2        1995-03-13   6900.00
9     1052  95  10200  6568-8        1995-04-10  21600.00
10    1023  89  10930  7554-4        1995-04-15   9000.00
11    1011  90  10340  8973-3        1995-02-05   9300.00
12    1141  95  10090  9594-4        1995-03-20  54000.00
13    1053  95  10120  8745-5        1995-05-15  13900.00
14    1102  92  10660  9444-4        1995-05-07   8000.00
15    1121  95  10490  5111-1        1995-02-12  13400.00
16    1131  95  10140  8912-2        1995-03-24  13800.00
17    1014  95  10690  6329-9        1995-01-15  16800.00
18    1111  95  10240  7192-2        1995-03-22  40000.00
19    1051  88  10780  7451-1        1995-03-23   7800.00
20    1033  95  10080  5698-8        1995-05-02  14400.00
21    1061  94  10790  5221-1        1995-04-15  19500.00
22    1022  85  10520  6568-8        2018-11-08   5000.00
23    1281  94  10280  9874-4        1995-01-30  20500.00

In [183]:
%%sql
select * from automoveis WHERE preco_tabela > 120000;

 * postgresql://postgres:***@localhost:5432/pos_db
   postgresql://postgres:***@localhost:5432/postgres
7 rows affected.

,codigo,ano,fabricante,modelo,preco_tabela,pais
0,1181,95,Porsche,938 GTS,180000.00,UK
1,1201,95,Ferrari,512,330000.00,Italia
2,1241,95,Rolls Royce,Corniche,499000.00,Inglaterra
3,1154,95,BMW,840,147000.00,Alemanha
4,1202,95,Ferrari,348,215000.00,Italia
5,1182,95,Porsche,921 Carrera,140000.00,Inglaterra
6,1194,95,Mercedes Benz,S500,170000.00,Alemanha

In [184]:
%%sql
select * from automoveis WHERE preco_tabela > 120000 AND automoveis.codigo NOT in (SELECT codigo FROM negocios);

 * postgresql://postgres:***@localhost:5432/pos_db
   postgresql://postgres:***@localhost:5432/postgres
7 rows affected.

,codigo,ano,fabricante,modelo,preco_tabela,pais
0,1181,95,Porsche,938 GTS,180000.00,UK
1,1201,95,Ferrari,512,330000.00,Italia
2,1241,95,Rolls Royce,Corniche,499000.00,Inglaterra
3,1154,95,BMW,840,147000.00,Alemanha
4,1202,95,Ferrari,348,215000.00,Italia
5,1182,95,Porsche,921 Carrera,140000.00,Inglaterra
6,1194,95,Mercedes Benz,S500,170000.00,Alemanha

## 6. Quais revendedoras (CGC) têm para vender automóveis dos anos 88 e 89?.

In [188]:
%%sql
select * from garagens;

 * postgresql://postgres:***@localhost:5432/pos_db
   postgresql://postgres:***@localhost:5432/postgres
70 rows affected.

    codigo ano    cgc  quantidade
0     1041  95  10020           5
1     1051  88  10780           2
2     1011  90  10340           2
3     1053  95  10100           5
4     1021  89  10980           2
..     ...  ..    ...         ...
65    1051  93  10780           2
66   99000  02  10510           1
67    1061  94  10790           2
68     100  90  10010           5
69    1281  94  10280           1

[70 rows x 4 columns]

In [210]:
%%sql
select * from revendedoras where revendedoras.cgc IN (select cgc from garagens where garagens.ano BETWEEN '88' AND '89') order by cgc;

 * postgresql://postgres:***@localhost:5432/pos_db
   postgresql://postgres:***@localhost:5432/postgres
6 rows affected.

     cgc                  nome estado                     cidade  proprietario
0  10030  Bahia Veiculos           BA  Ilheus                     5698-8
1  10200  Izio                     RJ  Petropolis                 5698-8
2  10310  Lian                     PE  Recife                     7192-2
3  10780  Santo Amaro              ES  Vitoria                    7192-2
4  10930  Elivel                   SP  Santos                     9753-3
5  10980  Sul Dive                 RS  Porto Alegre               7192-2

# Seguem, abaixo, as células com as consultas resolvidas!


---


❗**NÃO OLHAR ANTES de TENTAR FAZER** ❗

## 2. Listar os nomes dos fabricantes dos automóveis na base de dados e os respectivos países de origem.

In [ ]:
%%sql

SELECT DISTINCT Fabricante, Pais
FROM Automoveis
ORDER BY Fabricante

 * postgresql://postgres:***@localhost:5432/postgres
32 rows affected.

[('Audi                ', 'Alemanha            '),
 ('BMW                 ', 'Alemanha            '),
 ('Chevrolet           ', 'EUA                 '),
 ('Citroen             ', 'Franca              '),
 ('Daewoo              ', 'Coreia              '),
 ('Daihatsu            ', 'Coreia              '),
 ('Ferrari             ', 'Italia              '),
 ('Fiat                ', 'Italia              '),
 ('Fiat                ', 'Brasil              '),
 ('Ford                ', 'Brasil              '),
 ('Ford                ', 'EUA                 '),
 ('General Motors      ', 'EUA                 '),
 ('Gurgel              ', 'Brasil              '),
 ('Honda               ', 'Japao               '),
 ('Hyundai             ', 'Coreia              '),
 ('Jac                 ', 'Brasil              '),
 ('Lada                ', 'Russia              '),
 ('Land Rover          ', 'Inglaterra          '),
 ('Mazda               ', 'Japao               '),
 ('Mercedes Benz       ', 'Alemanha            '),
 ('Mercedez Benz       ', 'Alemanha            '),
 ('Mitsubishi          ', 'Japao               '),
 ('Nissan              ', 'Japao               '),
 ('Peugeot             ', 'Franca              '),
 ('Porsche             ', 'UK                  '),
 ('Porsche             ', 'Inglaterra          '),
 ('Renault             ', 'Franca              '),
 ('Rolls Royce         ', 'Inglaterra          '),
 ('Suzuki              ', 'Japao               '),
 ('Toyota              ', 'Japao               '),
 ('Volkswagen          ', 'Alemanha            '),
 ('Volvo               ', 'Suecia              ')]

## 3. Listar os nomes das pessoas que são potenciais compradoras de automóveis, moradoras do estado do Rio de Janeiro, e que também sejam proprietárias de revendedoras

In [ ]:
%%sql

SELECT CPF, Nome
FROM Consumidores
WHERE Estado = 'RJ'
AND CPF IN
(SELECT proprietario FROM revendedoras)

 * postgresql://postgres:***@localhost:5432/postgres
8 rows affected.

[('8999-9      ', 'Paulo          '),
 ('7451-1      ', 'Marcos         '),
 ('6228-8      ', 'Benedita       '),
 ('8981-1      ', 'Gilberto       '),
 ('5698-8      ', 'Romario        '),
 ('6565-5      ', 'Claudio        '),
 ('6568-8      ', 'Caetano        '),
 ('8745-5      ', 'Vera           ')]

## 4. Quais revendedoras presentes nos estados da Bahia e Pernambuco?

In [ ]:
%%sql

SELECT CGC, Nome
FROM Revendedoras
WHERE Estado = 'BA'
OR Estado = 'PE'
ORDER BY Estado

 * postgresql://postgres:***@localhost:5432/postgres
11 rows affected.

[(10030, 'Bahia Veiculos      '),
 (10100, 'Self Car            '),
 (10020, 'Courcelles          '),
 (10540, 'Superauto           '),
 (10610, 'Mirage              '),
 (10790, 'Caltabiano          '),
 (10040, 'Fracalanza          '),
 (10310, 'Lian                '),
 (10080, 'Self Car            '),
 (10420, 'Cavox               '),
 (10180, 'Libra               ')]

## 5. Quais são os automóveis no banco de dados, com valor tabelado superior a 120 mil reais, que ainda não foram comprados por consumidor algum?

In [ ]:
%%sql

SELECT Codigo, Fabricante, Modelo
FROM Automoveis
WHERE Preco_tabela > 120000
AND (Codigo, Ano) NOT IN
(SELECT Codigo, Ano FROM Negocios)

 * postgresql://postgres:***@localhost:5432/postgres
7 rows affected.

[(1181, 'Porsche             ', '938 GTS             '),
 (1201, 'Ferrari             ', '512                 '),
 (1241, 'Rolls Royce         ', 'Corniche            '),
 (1154, 'BMW                 ', '840                 '),
 (1202, 'Ferrari             ', '348                 '),
 (1182, 'Porsche             ', '921 Carrera         '),
 (1194, 'Mercedes Benz       ', 'S500                ')]

## 6. Quais revendedoras (CGC) têm para vender automóveis dos anos 88 e 89?.

In [ ]:
%%sql

SELECT DISTINCT CGC
FROM Garagens
WHERE Ano IN ('88', '89')
ORDER BY CGC

 * postgresql://postgres:***@localhost:5432/postgres
6 rows affected.

[(10030,), (10200,), (10310,), (10780,), (10930,), (10980,)]